<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Governorate;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class CitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [

            'القاهرة' => [
                'القاهرة','مدينة نصر','مصر الجديدة','المعادي',
                'القاهرة الجديدة','شبرا','عين شمس','حلوان','15 مايو'
            ],

            'الجيزة' => [
                'الجيزة','الدقي','الهرم','إمبابة',
                '6 أكتوبر','الشيخ زايد','العياط','الصف','أطفيح','البدرشين'
            ],

            'الإسكندرية' => [
                'الإسكندرية','برج العرب'
            ],

            'القليوبية' => [
                'بنها','قليوب','شبرا الخيمة','طوخ',
                'كفر شكر','شبين القناطر','الخانكة','القناطر الخيرية'
            ],

            'الشرقية' => [
                'الزقازيق','العاشر من رمضان','بلبيس','منيا القمح',
                'أبو كبير','فاقوس','ههيا','مشتول السوق',
                'ديرب نجم','كفر صقر','أولاد صقر','الحسينية','صان الحجر'
            ],

            'الدقهلية' => [
                'المنصورة','طلخا','ميت غمر','دكرنس','أجا',
                'منية النصر','شربين','بلقاس','تمي الأمديد',
                'السنبلاوين','جمصة'
            ],

            'الغربية' => [
                'طنطا','المحلة الكبرى','زفتى',
                'كفر الزيات','بسيون','سمنود','قطور'
            ],

            'المنوفية' => [
                'شبين الكوم','مدينة السادات','منوف',
                'أشمون','الباجور','قويسنا','بركة السبع','تلا'
            ],

            'البحيرة' => [
                'دمنهور','كفر الدوار','رشيد','إدكو','أبو حمص',
                'أبو المطامير','حوش عيسى','كوم حمادة',
                'الدلنجات','إيتاي البارود'
            ],

            'كفر الشيخ' => [
                'كفر الشيخ','دسوق','بلطيم','مطوبس',
                'سيدي سالم','فوه','قلين','بيلا','الحامول'
            ],

            'دمياط' => [
                'دمياط','دمياط الجديدة','رأس البر',
                'فارسكور','كفر سعد','الزرقا','عزبة البرج'
            ],

            'بورسعيد' => [
                'بورسعيد','بورفؤاد'
            ],

            'الإسماعيلية' => [
                'الإسماعيلية','فايد','القنطرة شرق',
                'القنطرة غرب','أبو صوير','التل الكبير'
            ],

            'السويس' => [
                'السويس','العين السخنة'
            ],

            'الفيوم' => [
                'الفيوم','سنورس','إبشواي',
                'طامية','يوسف الصديق','إطسا'
            ],

            'بني سويف' => [
                'بني سويف','ناصر','إهناسيا',
                'ببا','الفشن','سمسطا','الواسطى'
            ],

            'المنيا' => [
                'المنيا','ملوي','سمالوط','مغاغة',
                'بني مزار','أبو قرقاص','دير مواس','العدوة'
            ],

            'أسيوط' => [
                'أسيوط','ديروط','منفلوط','القوصية',
                'أبو تيج','البداري','ساحل سليم','أبنوب','الفتح'
            ],

            'سوهاج' => [
                'سوهاج','أخميم','جرجا','طهطا','طما',
                'البلينا','دار السلام','المنشأة','جهينة','ساقلته'
            ],

            'قنا' => [
                'قنا','نجع حمادي','قوص','دشنا',
                'أبو تشت','فرشوط','الوقف','نقادة'
            ],

            'الأقصر' => [
                'الأقصر','إسنا','أرمنت','الطود','البياضية','الزينية'
            ],

            'أسوان' => [
                'أسوان','كوم أمبو','إدفو','دراو','نصر النوبة','أبو سمبل'
            ],

            'البحر الأحمر' => [
                'الغردقة','سفاجا','مرسى علم','القصير','رأس غارب','شلاتين','حلايب'
            ],

            'الوادي الجديد' => [
                'الخارجة','الداخلة','الفرافرة','باريس','بلاط'
            ],

            'مطروح' => [
                'مرسى مطروح','سيوة','العلمين',
                'الضبعة','السلوم','سيدي براني','النجيلة'
            ],

            'شمال سيناء' => [
                'العريش','الشيخ زويد','رفح','بئر العبد','الحسنة','نخل'
            ],

            'جنوب سيناء' => [
                'شرم الشيخ','دهب','طابا','نويبع',
                'سانت كاترين','رأس سدر','أبو رديس','أبو زنيمة','الطور'
            ],
        ];

        foreach ($data as $govName => $cities) {
            $governorate = Governorate::where('name_ar', $govName)->first();

            if (!$governorate) {
                continue;
            }

            foreach ($cities as $city) {
                City::create([
                    'name_ar' => $city,
                    'governorate_id' => $governorate->id,
                ]);
            }
        }
    }
}
